Edited/GetCDMeterState_Request.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Header>
		<ns1:MultiSpeakMsgHeader xmlns:ns1="http://www.multispeak.org/Version_3.0" soapenv:actor="http://schemas.xmlsoap.org/soap/actor/next" soapenv:mustUnderstand="0" AppName="" Company="" Pwd="" UserID=""/>
	</soapenv:Header>
	<soapenv:Body>
		<GetCDMeterState xmlns="http://www.multispeak.org/Version_3.0">
			<meterNo>98149804</meterNo>
		</GetCDMeterState>
	</soapenv:Body>
</soapenv:Envelope>